import type { Email } from '../types';

// メモ マスターデータにしたら消す
export const sampleEmails: Email[] = [
  {
    id: '1',
    from: '佐々木俊光',
    subject: '毎日飲んでみるみる元気です。いつもどうもありがとうございます。',
    body: '前略。\n初めまして。\n菊池信彦と申します。\n\n営業本部長の弁道様の御請演会を拝聴しまして。\n是非こちらのお水の定期購入をしたくご連絡致しました。\n\n当日にいただいたチラシの初回セットの購入をお願いいたします。\nセット：ほほえみ初回セット\n割引：初回限定割引',
    date: '9:02',
    time: '9:02',
    isRead: false
  },
  {
    id: '2',
    from: '畑中 君彦',
    subject: '御繋りに幸甚の至り',
    body: '御繋りに幸甚の至り',
    date: '7:53',
    time: '7:53',
    isRead: false
  },
  {
    id: '3',
    from: '山田ひろ子',
    subject: 'ペットの猫に飲ませても大丈夫なのでしょうか',
    body: 'ペットの猫に飲ませても大丈夫なのでしょうか',
    date: '6:50',
    time: '6:50',
    isRead: false
  },
  {
    id: '4',
    from: '福原海',
    subject: '今日も笑み顔です。おはようございます。',
    body: '今日も笑み顔です。おはようございます。',
    date: '4:30',
    time: '4:30',
    isRead: false
  },
  {
    id: '5',
    from: 'グロースマーケティン株式会',
    subject: '【ご入金のご案内】プロパイオマーケティングサービス契約更新につきまして',
    body: '【ご入金のご案内】プロパイオマーケティングサービス契約更新につきまして',
    date: '3月8日',
    time: '15:45',
    isRead: true
  },
  {
    id: '6',
    from: '洲崎 敏子',
    subject: '返金不要です。素晴らしいお水をありがとうございます。',
    body: '返金不要です。素晴らしいお水をありがとうございます。',
    date: '3月8日',
    time: '14:30',
    isRead: true
  },
  {
    id: '7',
    from: '菊池道宣',
    subject: '初回セット購入希望',
    body: '前略。\n初めまして。\n菊池信彦と申します。\n\n営業本部長の弁道様の御請演会を拝聴しまして。\n是非こちらのお水の定期購入をしたくご連絡致しました。\n\n当日にいただいたチラシの初回セットの購入をお願いいたします。\nセット：ほほえみ初回セット\n割引：初回限定割引',
    date: '3月8日',
    time: '13:20',
    isRead: true
  },
  {
    id: '8',
    from: '萬子義彦',
    subject: '＜重要＞定例会議までに御準備ください。',
    body: '＜重要＞定例会議までに御準備ください。',
    date: '3月8日',
    time: '12:15',
    isRead: true
  },
  {
    id: '9',
    from: '近藤久志',
    subject: 'ノルマ報告（違15件／70件）',
    body: 'ノルマ報告（違15件／70件）',
    date: '3月8日',
    time: '11:45',
    isRead: true
  },
  {
    id: '10',
    from: '洲崎 敏子',
    subject: '【警告】10日以内に返金対応をお願いします。何度もお電話を差し上げまし',
    body: '【警告】10日以内に返金対応をお願いします。何度もお電話を差し上げましたが、つながりませんでした。',
    date: '3月8日',
    time: '10:30',
    isRead: false
  },
  {
    id: '11',
    from: '福原海',
    subject: '今日も笑み顔です。おはようございます。',
    body: '今日も笑み顔です。おはようございます。',
    date: '3月8日',
    time: '9:15',
    isRead: true
  }
];
